0.orig/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 273.5;

boundaryField
{
    heatingWall
    {
        type            fixedValue;
        value           uniform 273.5;
    }

    coolingWall
    {
        type            fixedValue;
        value           uniform 272.5;
    }

    insulated
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
