0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    heatingWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 1;
    }
    coolingWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 1;
    }
    insulated
    {
        type            compressible::alphatWallFunction;
        value           uniform 1;
    }
}


// ************************************************************************* //
