system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidifcationMeltingSource1
{
    type            solidificationMeltingSource;
    active          on;

    solidificationMeltingSourceCoeffs
    {
        selectionMode   all;

        Tsol           273;
        L              334000; // enthalpy of fusion for water [J/kg]
        thermoMode     thermo; //lookup; // retrieve thermo properties from thermo model
        beta            0 ;   //50e-6;  // thermal expansion coeff [1/K]
        rhoRef         916.8;
    }
}

// ************************************************************************* //
